#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    Объект.КоличествоНаСкладе = ПолучитьОстаток(Объект.Ссылка);
    Объект.Цена = ПолучитьАктуальнуюЦену(Объект.Ссылка);
    
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОстаток(Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваровОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваров.Остатки(&Период, Номенклатура = &Номенклатура) КАК ОстаткиТоваровОстатки";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучитьАктуальнуюЦену(Номенклатура) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	УстановкаЦенНоменклатуры.Цена
    |ИЗ
    |	РегистрСведений.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
    |ГДЕ
    |	УстановкаЦенНоменклатуры.Номенклатура = &Номенклатура
    |	И УстановкаЦенНоменклатуры.Период <= &Дата
    |
    |УПОРЯДОЧИТЬ ПО
    |	УстановкаЦенНоменклатуры.Период УБЫВ";

    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
    Запрос.УстановитьПараметр("Дата", ТекущаяДата());
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Цена;
    Иначе
        Возврат 0;
    КонецЕсли;
КонецФункции
#КонецОбласти